# ДЗ 1, задача 11 «Одна открытая касса» (★★★)
# Задачник, задача 2.2.13: https://python-theory-makarov.vercel.app/zadachnik/2-2/index.html#p13
#
# В магазине три кассы. Про каждую вводится ответ, открыта ли она: «да» или «нет». Выведите, верно
# ли, что открыта ровно одна касса.
#
# Каждый input() выводит подсказку. Тексты подсказок — как в примерах, после двоеточия или скобки
# стоит пробел.
#
# Пример 1
#   ввод:
#     нет
#     да
#     нет
#   в терминале:
#     Касса 1 открыта (да/нет): нет
#     Касса 2 открыта (да/нет): да
#     Касса 3 открыта (да/нет): нет
#     True
# Пример 2
#   ввод:
#     да
#     да
#     нет
#   в терминале:
#     Касса 1 открыта (да/нет): да
#     Касса 2 открыта (да/нет): да
#     Касса 3 открыта (да/нет): нет
#     False
# Пример 3
#   ввод:
#     нет
#     нет
#     нет
#   в терминале:
#     Касса 1 открыта (да/нет): нет
#     Касса 2 открыта (да/нет): нет
#     Касса 3 открыта (да/нет): нет
#     False
# Пример 4
#   ввод:
#     да
#     да
#     да
#   в терминале:
#     Касса 1 открыта (да/нет): да
#     Касса 2 открыта (да/нет): да
#     Касса 3 открыта (да/нет): да
#     False

# Решение

box_officeOne = input("Касса 1 открыта (да/нет): ")
box_officeTwo = input("Касса 2 открыта (да/нет): ")
box_officeThree = input("Касса 3 открыта (да/нет): ")

account_box_office = 0    #счёт касс

if box_officeOne == "да":
    account_box_office += 1
if box_officeTwo == "да":
    account_box_office += 1
if box_officeThree == "да":
    account_box_office += 1


print(account_box_office == 1)


